app/controllers/ownerships_controller.rb

  def create
    if params[:asin]
      @book = Book.find_or_initialize_by(asin: params[:asin])
    else
      @book = Book.find(params[:book_id])
---
SELECT  "books".* FROM "books" WHERE "books"."asin" = ? LIMIT 1  [["asin", "B0064FHRWE"]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 22]]