app/controllers/users_controller.rb

SELECT "books".* FROM "books" INNER JOIN "ownerships" ON "books"."id" = "ownerships"."book_id" WHERE "ownerships"."user_id" = ? GROUP BY books.id  [["user_id", 1]]
---
  def show
    @books = @user.books.group('books.id')