app/controllers/welcome_controller.rb

  def index
    @books = Book.all.order("updated_at DESC").limit(30)
---
SELECT  "books".* FROM "books"  ORDER BY updated_at DESC LIMIT 30